help/help.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>How to play EvilToys</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="How to play EvilToys"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-03-04 15:11:59 WET"/>
<meta name="author" content="Ahmed Mansour"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">How to play EvilToys</h1>



<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 What is EvitToys?</a></li>
<li><a href="#sec-2">2 How to play</a>
<ul>
<li><a href="#sec-2-1">2.1 Navigation</a></li>
<li><a href="#sec-2-2">2.2 Buttons and doors</a></li>
<li><a href="#sec-2-3">2.3 Unexploded ordnance and mines</a></li>
<li><a href="#sec-2-4">2.4 The museum</a></li>
<li><a href="#sec-2-5">2.5 Purple diamond</a></li>
</ul>
</li>
<li><a href="#sec-3">3 Acknowledgments</a></li>
<li><a href="#sec-4">4 Legal information</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> What is EvitToys?</h2>
<div class="outline-text-2" id="text-1">

<p>  it's a 3D educational video game for children, to learn about danger of landmines
  and cluster munitions, by playing inside a virtual world and learning to recognize them and avoid them.
  the child will also learn signs that indicate dangerous area. Which make the child adopt safe behaviour 
  when faced with similar situation in real life.
  I hope through playing and learning with this software, it will contribute to saving children life in countries affected by war.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> How to play</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Navigation</h3>
<div class="outline-text-3" id="text-2-1">

<p>  You can navigate through the virtual world by using keyboard arrow keys and mouse:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">key</th><th scope="col" class="left">Description</th></tr>
</thead>
<tbody>
<tr><td class="left">UP KEY</td><td class="left">Move forward</td></tr>
<tr><td class="left">DOWN KEY</td><td class="left">Move backward</td></tr>
<tr><td class="left">LEFT KEY</td><td class="left">Slide left</td></tr>
<tr><td class="left">RIGHT KEY</td><td class="left">Slide right</td></tr>
<tr><td class="left">SPACE KEY</td><td class="left">Jump up</td></tr>
<tr><td class="left">MOUSE</td><td class="left">Use mouse to choose a direction</td></tr>
<tr><td class="left"></td><td class="left">and keyboard to move forward</td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Buttons and doors</h3>
<div class="outline-text-3" id="text-2-2">

<p>   Some doors are closed, to open them and access new areas, you need to press red button near the door.
</p></div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Unexploded ordnance and mines</h3>
<div class="outline-text-3" id="text-2-3">

<p>   To progress in the game and discover new secret areas, you need to avoid getting near mines because they explode
   and will hurt you. you can avoid them by watching them closely in the museum, and by staying away when you see danger sign.
</p>
</div>

</div>

<div id="outline-container-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> The museum</h3>
<div class="outline-text-3" id="text-2-4">

<p>   is found in beginning of the game, it is the only safe place where the child can get close to mines and see them and remember their shape
   as he need to avoid getting near them later in the game.
</p></div>

</div>

<div id="outline-container-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> Purple diamond</h3>
<div class="outline-text-3" id="text-2-5">

<p>   You need to collect all purple diamond that you can find, every one give you more health and help you to survive and continue playing.
   the diamond is only thing you need to collect in the game and being choosed as color purple is rarely used in military on in nature and
   shape cannot be confused with explosives. so the child will not look for them or confuse them with dangerous object in real life .
</p>
</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Acknowledgments</h2>
<div class="outline-text-2" id="text-3">


<p>
  I would like to thank all NGOs workers that risk their life for saving other's, through demining and other humanitarian actions.
</p>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Legal information</h2>
<div class="outline-text-2" id="text-4">


<p>
This game is Free software (free as in freedom), you can freely copy it, modify it and distribute modified versions,
See COPYING file for details.
</p></div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-03-04 15:11:59 WET</p>
<p class="author">Author: Ahmed Mansour</p>
<p class="creator">Org version 7.8.03 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
